faraabin/fw_nucleo_h743_faraabin_example/src/app/app_integrator/conf/stm32h7xx_phal_config.h
/**
 ******************************************************************************
 * @file           : stm32h7xx_phal_config.h
 * @brief          :
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 FaraabinCo.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component
 * 
 * https://faraabinco.ir/
 * https://github.com/FaraabinCo
 *
 ******************************************************************************
 * @verbatim
 * @endverbatim
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef stm32h7xx_phal_config_H
#define stm32h7xx_phal_config_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <stdbool.h>

/* Exported defines ----------------------------------------------------------*/
/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                          ##### Phal Watchdog Parameter #####                     ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define PHAL_WD_ENABLE

/**
 * @brief 
 * 
 */
#define meHAL_IWDG_PRESCALER  128  //4-8-16-32-64-128-256

/**
 * @brief 
 * 
 */
#define meHAL_IWDG_CLOCK         32000

/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                          ##### Phal UART Parameter #####                         ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define UART1_ENABLE
//#define UART2_ENABLE
#define UART3_ENABLE
//#define UART4_ENABLE
//#define UART5_ENABLE
//#define UART6_ENABLE
//#define UART7_ENABLE
//#define UART8_ENABLE

/**
 * @brief 
 * 
 */
#define UART1_TX_PORT_PIN  AUX_PA9    //PA9-PB6-PB14
#define UART1_RX_PORT_PIN  AUX_PA10   //PA10-PB7-PB15

/**
 * @brief 
 * 
 */
//#define UART1_DE_ENABLE
#define UART1_DE_PORT_PIN  AUX_PA12  //PA12
#define UART1_DE_POLARITY_HIGH  true //true-false
#define UART1_DE_ASSERTION_TIME 31  //0~31
#define UART1_DE_DEASSERTION_TIME 31  //0~31

/**
 * @brief 
 * 
 */
//#define UART1_TX_DMA_CFG   DMA1_STREAM0
//#define UART1_RX_DMA_CFG   DMA1_STREAM1

#define UART1_TX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR
#define UART1_RX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR

/**
 * @brief 
 * 
 */
#define UART1_TX_DMA_IRQ_PreemptPriority  2
#define UART1_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART1_RX_DMA_IRQ_PreemptPriority  2
#define UART1_RX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART1_IRQ_PreemptPriority  2
#define UART1_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART1_OVERSAMPLING  UART_OVERSAMPLING_16 //UART_OVERSAMPLING_16-UART_OVERSAMPLING_8

/**
 * @brief 
 * 
 */
#define UART1_TXINVERT_ENABLE            false  //true-false
#define UART1_RXINVERT_ENABLE            false  //true-false
#define UART1_DATA_BINARY_INVERT_ENABLE  false  //true-false
#define UART1_PIN_SWAP_ENABLE            false  //true-false
  
/**
 * @brief 
 * 
 */
#define UART2_TX_PORT_PIN  AUX_PD5   //PA2-PD5
#define UART2_RX_PORT_PIN  AUX_PD6   //PA3-PD6

/**
 * @brief 
 * 
 */
//#define UART2_DE_ENABLE
#define UART2_DE_PORT_PIN  AUX_PD4  //PA1-PD4
#define UART2_DE_POLARITY_HIGH  true //true-false
#define UART2_DE_ASSERTION_TIME 31  //0~31
#define UART2_DE_DEASSERTION_TIME 31  //0~31

/**
 * @brief 
 * 
 */
#define UART2_TX_DMA_CFG   DMA1_STREAM0
#define UART2_RX_DMA_CFG   DMA1_STREAM1

#define UART2_TX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR
#define UART2_RX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR

/**
 * @brief 
 * 
 */
#define UART2_TX_DMA_IRQ_PreemptPriority  2
#define UART2_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART2_RX_DMA_IRQ_PreemptPriority  2
#define UART2_RX_DMA_IRQ_SubPriority      2

/** 
  * @brief
  */
#define UART2_IRQ_PreemptPriority  2
#define UART2_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART2_OVERSAMPLING  UART_OVERSAMPLING_16 //UART_OVERSAMPLING_16-UART_OVERSAMPLING_8

/**
 * @brief 
 * 
 */
#define UART2_TXINVERT_ENABLE            false  //true-false
#define UART2_RXINVERT_ENABLE            false  //true-false
#define UART2_DATA_BINARY_INVERT_ENABLE  false  //true-false
#define UART2_PIN_SWAP_ENABLE            false  //true-false

/**
 * @brief 
 * 
 */
#define UART3_TX_PORT_PIN  AUX_PD8  //PC10-PD8-PB10
#define UART3_RX_PORT_PIN  AUX_PD9  //PC11-PD9-PB11

/**
 * @brief 
 * 
 */
//#define UART3_DE_ENABLE
#define UART3_DE_PORT_PIN  AUX_PB14  //PB14-PD12
#define UART3_DE_POLARITY_HIGH  true //true-false
#define UART3_DE_ASSERTION_TIME 31  //0~31
#define UART3_DE_DEASSERTION_TIME 31  //0~31

/**
 * @brief 
 * 
 */
#define UART3_TX_DMA_CFG   DMA1_STREAM2
#define UART3_RX_DMA_CFG   DMA1_STREAM3

#define UART3_TX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR
#define UART3_RX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR

/** 
  * @brief
  */
#define UART3_TX_DMA_IRQ_PreemptPriority  2
#define UART3_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART3_RX_DMA_IRQ_PreemptPriority  0
#define UART3_RX_DMA_IRQ_SubPriority      0

/**
 * @brief 
 * 
 */
#define UART3_IRQ_PreemptPriority  2
#define UART3_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART3_OVERSAMPLING  UART_OVERSAMPLING_16 //UART_OVERSAMPLING_16-UART_OVERSAMPLING_8

/**
 * @brief 
 * 
 */
#define UART3_TXINVERT_ENABLE            false  //true-false
#define UART3_RXINVERT_ENABLE            false  //true-false
#define UART3_DATA_BINARY_INVERT_ENABLE  false  //true-false
#define UART3_PIN_SWAP_ENABLE            false  //true-false

/**
 * @brief 
 * 
 */
#define UART4_TX_PORT_PIN  AUX_PD1  //PA0-PC10-PA12-PH13-PD1
#define UART4_RX_PORT_PIN  AUX_PD0  //PA1-PC11-PI9-PA11-PH14-PD0

/**
 * @brief 
 * 
 */
//#define UART4_DE_ENABLE
#define UART4_DE_PORT_PIN  AUX_PB14  //PB14-PA15
#define UART4_DE_POLARITY_HIGH  true //true-false
#define UART4_DE_ASSERTION_TIME 31  //0~31
#define UART4_DE_DEASSERTION_TIME 31  //0~31

/**
 * @brief 
 * 
 */
// #define UART4_TX_DMA_CFG   DMA1_STREAM4
// #define UART4_RX_DMA_CFG   DMA1_STREAM5

#define UART4_TX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR
#define UART4_RX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR

/**
 * @brief 
 * 
 */
#define UART4_TX_DMA_IRQ_PreemptPriority  1
#define UART4_TX_DMA_IRQ_SubPriority      1

/**
 * @brief 
 * 
 */
#define UART4_RX_DMA_IRQ_PreemptPriority  1
#define UART4_RX_DMA_IRQ_SubPriority      1

/**
 * @brief 
 * 
 */
#define UART4_IRQ_PreemptPriority  1
#define UART4_IRQ_SubPriority      1

/**
 * @brief 
 * 
 */
#define UART4_OVERSAMPLING  UART_OVERSAMPLING_16 //UART_OVERSAMPLING_16-UART_OVERSAMPLING_8

/**
 * @brief 
 * 
 */
#define UART4_TXINVERT_ENABLE            false  //true-false
#define UART4_RXINVERT_ENABLE            false  //true-false
#define UART4_DATA_BINARY_INVERT_ENABLE  false  //true-false
#define UART4_PIN_SWAP_ENABLE            false  //true-false

/**
 * @brief 
 * 
 */
#define UART5_TX_PORT_PIN  AUX_PC12  //PC12-PB13-PB6-PB9
#define UART5_RX_PORT_PIN  AUX_PD2   //PD2-PB12-PB5-PB8

/**
 * @brief 
 * 
 */
//#define UART5_DE_ENABLE
#define UART5_DE_PORT_PIN  AUX_PC8  //PC8
#define UART5_DE_POLARITY_HIGH  true //true-false
#define UART5_DE_ASSERTION_TIME 31  //0~31
#define UART5_DE_DEASSERTION_TIME 31  //0~31

/**
 * @brief 
 * 
 */
//#define UART5_TX_DMA_CFG   DMA2_STREAM0
//#define UART5_RX_DMA_CFG   DMA2_STREAM1

#define UART5_TX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR
#define UART5_RX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR

/**
 * @brief 
 * 
 */
#define UART5_TX_DMA_IRQ_PreemptPriority  2
#define UART5_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART5_RX_DMA_IRQ_PreemptPriority  2
#define UART5_RX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART5_IRQ_PreemptPriority  2
#define UART5_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART5_OVERSAMPLING  UART_OVERSAMPLING_16 //UART_OVERSAMPLING_16-UART_OVERSAMPLING_8

/**
 * @brief 
 * 
 */
#define UART5_TXINVERT_ENABLE            false  //true-false
#define UART5_RXINVERT_ENABLE            false  //true-false
#define UART5_DATA_BINARY_INVERT_ENABLE  false  //true-false
#define UART5_PIN_SWAP_ENABLE            false  //true-false

/**
 * @brief 
 * 
 */
#define UART6_TX_PORT_PIN AUX_PG14  //PC6-PG14
#define UART6_RX_PORT_PIN AUX_PG9  //PC7-PG9

/**
 * @brief 
 * 
 */
//#define UART6_DE_ENABLE
#define UART6_DE_PORT_PIN  AUX_PG12  //PG8-PG12
#define UART6_DE_POLARITY_HIGH  true //true-false
#define UART6_DE_ASSERTION_TIME 31  //0~31
#define UART6_DE_DEASSERTION_TIME 31  //0~31

/**
 * @brief 
 * 
 */
#define UART6_TX_DMA_CFG   DMA1_STREAM4
#define UART6_RX_DMA_CFG   DMA1_STREAM5

#define UART6_TX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR
#define UART6_RX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR

/**
 * @brief 
 * 
 */
#define UART6_TX_DMA_IRQ_PreemptPriority  2
#define UART6_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART6_RX_DMA_IRQ_PreemptPriority  2
#define UART6_RX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART6_IRQ_PreemptPriority  2
#define UART6_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART6_OVERSAMPLING  UART_OVERSAMPLING_16 //UART_OVERSAMPLING_16-UART_OVERSAMPLING_8

/**
 * @brief 
 * 
 */
#define UART6_TXINVERT_ENABLE            false  //true-false
#define UART6_RXINVERT_ENABLE            false  //true-false
#define UART6_DATA_BINARY_INVERT_ENABLE  false  //true-false
#define UART6_PIN_SWAP_ENABLE            false  //true-false

/**
 * @brief 
 * 
 */
#define UART7_TX_PORT_PIN AUX_PE8  //PF7-PE8-PA15-PB4
#define UART7_RX_PORT_PIN AUX_PE7  //PF6-PE7-PA8-PB3

/**
 * @brief 
 * 
 */
//#define UART7_DE_ENABLE
#define UART7_DE_PORT_PIN  AUX_PE9  //PF8-PE9
#define UART7_DE_POLARITY_HIGH  true //true-false
#define UART7_DE_ASSERTION_TIME 31  //0~31
#define UART7_DE_DEASSERTION_TIME 31  //0~31

/**
 * @brief 
 * 
 */
// #define UART7_TX_DMA_CFG   DMA1_STREAM6
// #define UART7_RX_DMA_CFG   DMA1_STREAM7

