faraabin/fw_nucleo_h743_faraabin_example/src/app/app_integrator/conf/stm32h7xx_phal_config.h
#define UART7_TX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR
#define UART7_RX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR

/**
 * @brief 
 * 
 */
#define UART7_TX_DMA_IRQ_PreemptPriority  2
#define UART7_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART7_RX_DMA_IRQ_PreemptPriority  2
#define UART7_RX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART7_IRQ_PreemptPriority  2
#define UART7_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART7_OVERSAMPLING  UART_OVERSAMPLING_16 //UART_OVERSAMPLING_16-UART_OVERSAMPLING_8

/**
 * @brief 
 * 
 */
#define UART7_TXINVERT_ENABLE            false  //true-false
#define UART7_RXINVERT_ENABLE            false  //true-false
#define UART7_DATA_BINARY_INVERT_ENABLE  false  //true-false
#define UART7_PIN_SWAP_ENABLE            false  //true-false

/**
 * @brief 
 * 
 */
#define UART8_TX_PORT_PIN AUX_PE1  //PE1
#define UART8_RX_PORT_PIN AUX_PE0  //PE0

/**
 * @brief 
 * 
 */
//#define UART8_DE_ENABLE
#define UART8_DE_PORT_PIN  AUX_PD15  //PD15
#define UART8_DE_POLARITY_HIGH  true //true-false
#define UART8_DE_ASSERTION_TIME 31  //0~31
#define UART8_DE_DEASSERTION_TIME 31  //0~31

/**
 * @brief 
 * 
 */
#define UART8_TX_DMA_CFG   DMA1_STREAM6
#define UART8_RX_DMA_CFG   DMA1_STREAM7

#define UART8_TX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR
#define UART8_RX_DMA_MODE   DMA_NORMAL //DMA_NORMAL-DMA_CIRCULAR

/**
 * @brief 
 * 
 */
#define UART8_TX_DMA_IRQ_PreemptPriority  2
#define UART8_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART8_RX_DMA_IRQ_PreemptPriority  2
#define UART8_RX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART8_IRQ_PreemptPriority  2
#define UART8_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define UART8_OVERSAMPLING  UART_OVERSAMPLING_16 //UART_OVERSAMPLING_16-UART_OVERSAMPLING_8

/**
 * @brief 
 * 
 */
#define UART8_TXINVERT_ENABLE            false  //true-false
#define UART8_RXINVERT_ENABLE            false  //true-false
#define UART8_DATA_BINARY_INVERT_ENABLE  false  //true-false
#define UART8_PIN_SWAP_ENABLE            false  //true-false

/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                       ##### Phal USBD_FS_VCP Parameter #####                     ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define USBD_FS_VCP_ENABLE

#define USBD_FS_VCP_IRQ_PreemptPriority    2
#define USBD_FS_VCP_IRQ_SubPriority        2

/** @defgroup USBD_DESC_Private_Defines USBD_DESC_Private_Defines
  * @brief Private defines.
  * @{
  */

#define USBD_VID                      1155
#define USBD_LANGID_STRING            1033
#define USBD_MANUFACTURER_STRING      "STMicroelectronics"
#define USBD_PID_FS                    22336
#define USBD_PRODUCT_STRING_FS        "Virtual ComPort"
#define USBD_CONFIGURATION_STRING_FS  "CDC Config"
#define USBD_INTERFACE_STRING_FS      "CDC Interface"

#define USB_SIZ_BOS_DESC              0x0C

/**
  * @}
  */

/** @defgroup USBD_DESC_Exported_Constants USBD_DESC_Exported_Constants
  * @brief Constants.
  * @{
  */
#define DEVICE_ID1            (UID_BASE)
#define DEVICE_ID2            (UID_BASE + 0x4)
#define DEVICE_ID3            (UID_BASE + 0x8)

#define USB_SIZ_STRING_SERIAL  0x1A

/**
  * @}
  */

/** @defgroup USBD_CDC_IF_Exported_Defines USBD_CDC_IF_Exported_Defines
  * @brief Defines.
  * @{
  */
/* Define size for the receive and transmit buffer over CDC */
//#define APP_RX_DATA_SIZE  2048
#define APP_TX_DATA_SIZE  2048
/**
  * @}
  */

/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                       ##### Phal USBD_HS_VCP Parameter #####                     ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define USBD_HS_VCP_ENABLE

#define USBD_HS_VCP_IRQ_PreemptPriority    2
#define USBD_HS_VCP_IRQ_SubPriority        2

/** @defgroup USBD_DESC_Private_Defines USBD_DESC_Private_Defines
  * @brief Private defines.
  * @{
  */

#define USBD_VID                      1155
#define USBD_LANGID_STRING            1033
#define USBD_MANUFACTURER_STRING      "STMicroelectronics"
#define USBD_PID_HS                   22336
#define USBD_PRODUCT_STRING_HS        "STM32 Virtual ComPort"
#define USBD_CONFIGURATION_STRING_HS  "CDC Config"
#define USBD_INTERFACE_STRING_HS      "CDC Interface"

#define USB_SIZ_BOS_DESC              0x0C

/**
  * @}
  */

/** @defgroup USBD_DESC_Exported_Constants USBD_DESC_Exported_Constants
  * @brief Constants.
  * @{
  */
#define DEVICE_ID1            (UID_BASE)
#define DEVICE_ID2            (UID_BASE + 0x4)
#define DEVICE_ID3            (UID_BASE + 0x8)

#define USB_SIZ_STRING_SERIAL  0x1A

/**
  * @}
  */

/** @defgroup USBD_CDC_IF_Exported_Defines USBD_CDC_IF_Exported_Defines
  * @brief Defines.
  * @{
  */
/* Define size for the receive and transmit buffer over CDC */
//#define APP_RX_DATA_SIZE  2048
#define APP_TX_DATA_SIZE  2048
/**
  * @}
  */

/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                          ##### Phal CAN Parameter #####                          ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define CAN1_ENABLE
//#define CAN2_ENABLE

/**
 * @brief 
 * 
 */
#define CAN1_TX_PORT_PIN  AUX_PH13   //PA12-PH13-PD1-PB9
#define CAN1_RX_PORT_PIN  AUX_PH14   //PA11-PH14-PD0-PB8-PI9

/**
 * @brief 
 * 
 */
#define CAN1_TX_FIFO_ELEMNT_QTY 10

/**
 * @brief 
 * 
 */
#define CAN1_IT0_IRQ_PreemptPriority  0
#define CAN1_IT0_IRQ_SubPriority      0

/**
 * @brief 
 * 
 */
#define CAN1_IT1_IRQ_PreemptPriority  2
#define CAN1_IT1_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define CAN2_TX_PORT_PIN  AUX_PB13   //PB13-PB6
#define CAN2_RX_PORT_PIN  AUX_PB12   //PB12-PB5

/**
 * @brief 
 * 
 */
#define CAN2_TX_FIFO_ELEMNT_QTY 10

/**
 * @brief 
 * 
 */
#define CAN2_IT0_IRQ_PreemptPriority  2
#define CAN2_IT0_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define CAN2_IT1_IRQ_PreemptPriority  2
#define CAN2_IT1_IRQ_SubPriority      2

