faraabin/fw_nucleo_h743_faraabin_example/src/app/app_integrator/conf/stm32h7xx_phal_config.h
/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                          ##### Phal RTC Parameter #####                          ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define RTC_ENABLE

/**
 * @brief 
 * 
 */
#define RTC_CLOCK_SOURCE_EXTERNAL //EXTERNAL-INTERNAL

/**
 * @brief 
 * 
 */
#define START_DATE 2000

/**
 * @brief 
 * 
 */
#define RTC_DAYLIGHTSAVING RTC_DAYLIGHTSAVING_NONE //NONE-SUB1H-ADD1H

/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                          ##### Phal SPI Parameter #####                          ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
#define SPI1_ENABLE
//#define SPI2_ENABLE
//#define SPI3_ENABLE
//#define SPI4_ENABLE
//#define SPI5_ENABLE
//#define SPI6_ENABLE

/**
 * @brief 
 * 
 */
#define SPI1_NSS_PORT_PIN  AUX_PA4    //PA4-PA15
#define SPI1_SCK_PORT_PIN  AUX_PA5   //PA5-PG11-PB3
#define SPI1_MISO_PORT_PIN  AUX_PA6   //PA6-PG9-PB4
#define SPI1_MOSI_PORT_PIN  AUX_PA7   //PA7-PD7-PB5

#define SPI1_NSS_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI1_NSS_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI1_SCK_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI1_SCK_PIN_PULL  GPIO_PULLUP //NOPULL-PULLUP-PULLDOWN

#define SPI1_MISO_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI1_MISO_PIN_PULL  GPIO_PULLUP //NOPULL-PULLUP-PULLDOWN

#define SPI1_MOSI_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI1_MOSI_PIN_PULL  GPIO_PULLUP //NOPULL-PULLUP-PULLDOWN

/**
 * @brief 
 * 
 */
#define SPI1_DIRECTION  SPI_DIRECTION_2LINES  // SPI_DIRECTION_2LINES-SPI_DIRECTION_2LINES_RXONLY-SPI_DIRECTION_1LINE
#define SPI1_NSS        SPI_NSS_SOFT          // SPI_NSS_SOFT-SPI_NSS_HARD_INPUT-SPI_NSS_HARD_OUTPUT
#define SPI1_FIRSTBIT   SPI_FIRSTBIT_MSB      // SPI_FIRSTBIT_MSB-SPI_FIRSTBIT_LSB
#define SPI1_DMA_MODE   DMA_NORMAL          // DMA_CIRCULAR-DMA_NORMAL

/**
 * @brief 
 * 
 */
#define SPI1_BAUD                   SPI_BAUDRATEPRESCALER_256 //2-4-8-15-32-64-128
#define SPI1_INTER_DATA_IDLE_CYCLE  SPI_MASTER_INTERDATA_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE
#define SPI1_SS_IDLE_CYCLE          SPI_MASTER_SS_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE

/**
 * @brief 
 * 
 */
#define SPI1_TX_DMA_CFG   DMA1_STREAM6
#define SPI1_RX_DMA_CFG   DMA1_STREAM7

/**
 * @brief 
 * 
 */
#define SPI1_TX_DMA_IRQ_PreemptPriority  2
#define SPI1_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define SPI1_RX_DMA_IRQ_PreemptPriority  2
#define SPI1_RX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define SPI2_NSS_PORT_PIN  AUX_PB9    //PB9-PB12-PI0
#define SPI2_SCK_PORT_PIN  AUX_PB13   //PB10-PB13-PI1-PA9-PA12-PD3
#define SPI2_MISO_PORT_PIN  AUX_PB14   //PC2-PB14-PI2
#define SPI2_MOSI_PORT_PIN  AUX_PB15   //PC1-PC3-PB13-PI3-PB15

#define SPI2_NSS_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI2_NSS_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI2_SCK_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI2_SCK_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI2_MISO_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI2_MISO_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI2_MOSI_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI2_MOSI_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

/**
 * @brief 
 * 
 */
#define SPI2_DIRECTION  SPI_DIRECTION_2LINES  // SPI_DIRECTION_2LINES-SPI_DIRECTION_2LINES_RXONLY-SPI_DIRECTION_1LINE
#define SPI2_NSS        SPI_NSS_SOFT          // SPI_NSS_SOFT-SPI_NSS_HARD_INPUT-SPI_NSS_HARD_OUTPUT
#define SPI2_FIRSTBIT   SPI_FIRSTBIT_MSB      // SPI_FIRSTBIT_MSB-SPI_FIRSTBIT_LSB
#define SPI2_DMA_MODE   DMA_NORMAL            // DMA_CIRCULAR-DMA_NORMAL

/**
 * @brief 
 * 
 */
#define SPI2_BAUD                   SPI_BAUDRATEPRESCALER_128 //2-4-8-15-32-64-128
#define SPI2_INTER_DATA_IDLE_CYCLE  SPI_MASTER_INTERDATA_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE
#define SPI2_SS_IDLE_CYCLE          SPI_MASTER_SS_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE

/**
 * @brief 
 * 
 */
//#define SPI2_TX_DMA_CFG   DMA1_STREAM2
//#define SPI2_RX_DMA_CFG   DMA1_STREAM2

/**
 * @brief 
 * 
 */
#define SPI2_TX_DMA_IRQ_PreemptPriority  2
#define SPI2_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define SPI2_RX_DMA_IRQ_PreemptPriority  2
#define SPI2_RX_DMA_IRQ_SubPriority      2
  
/**
 * @brief 
 * 
 */
#define SPI3_NSS_PORT_PIN  AUX_PA4    //PA4-PA15
#define SPI3_SCK_PORT_PIN  AUX_PC10   //PC10-PB3
#define SPI3_MISO_PORT_PIN  AUX_PC11   //PC11-PB4
#define SPI3_MOSI_PORT_PIN  AUX_PC12   //PC12-PD6-PB5

#define SPI3_NSS_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI3_NSS_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI3_SCK_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI3_SCK_PIN_PULL  GPIO_PULLUP //NOPULL-PULLUP-PULLDOWN

#define SPI3_MISO_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI3_MISO_PIN_PULL  GPIO_PULLUP //NOPULL-PULLUP-PULLDOWN

#define SPI3_MOSI_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI3_MOSI_PIN_PULL  GPIO_PULLUP //NOPULL-PULLUP-PULLDOWN

/**
 * @brief 
 * 
 */
#define SPI3_DIRECTION  SPI_DIRECTION_2LINES  // SPI_DIRECTION_2LINES-SPI_DIRECTION_2LINES_RXONLY-SPI_DIRECTION_1LINE
#define SPI3_NSS        SPI_NSS_SOFT          // SPI_NSS_SOFT-SPI_NSS_HARD_INPUT-SPI_NSS_HARD_OUTPUT
#define SPI3_FIRSTBIT   SPI_FIRSTBIT_MSB      // SPI_FIRSTBIT_MSB-SPI_FIRSTBIT_LSB
#define SPI3_DMA_MODE   DMA_NORMAL            // DMA_CIRCULAR-DMA_NORMAL

/**
 * @brief 
 * 
 */
#define SPI3_BAUD                   SPI_BAUDRATEPRESCALER_32 //2-4-8-15-32-64-128
#define SPI3_INTER_DATA_IDLE_CYCLE  SPI_MASTER_INTERDATA_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE
#define SPI3_SS_IDLE_CYCLE          SPI_MASTER_SS_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE

/**
 * @brief 
 * 
 */
//#define SPI3_TX_DMA_CFG   DMA1_STREAM2
//#define SPI3_RX_DMA_CFG   DMA1_STREAM2

/**
 * @brief 
 * 
 */
#define SPI3_TX_DMA_IRQ_PreemptPriority  2
#define SPI3_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define SPI3_RX_DMA_IRQ_PreemptPriority  2
#define SPI3_RX_DMA_IRQ_SubPriority      2
  
/**
 * @brief 
 * 
 */
#define SPI4_NSS_PORT_PIN  AUX_PE4     //PE4-PE11
#define SPI4_SCK_PORT_PIN  AUX_PE2     //PE2-PE12
#define SPI4_MISO_PORT_PIN  AUX_PE5   //PE5-PE13
#define SPI4_MOSI_PORT_PIN  AUX_PE6   //PE6-PE14

