faraabin/fw_nucleo_h743_faraabin_example/src/app/app_integrator/conf/stm32h7xx_phal_config.h
#define SPI4_NSS_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI4_NSS_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI4_SCK_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI4_SCK_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI4_MISO_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI4_MISO_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI4_MOSI_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI4_MOSI_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

/**
 * @brief 
 * 
 */
#define SPI4_DIRECTION  SPI_DIRECTION_2LINES  // SPI_DIRECTION_2LINES-SPI_DIRECTION_2LINES_RXONLY-SPI_DIRECTION_1LINE
#define SPI4_NSS        SPI_NSS_SOFT          // SPI_NSS_SOFT-SPI_NSS_HARD_INPUT-SPI_NSS_HARD_OUTPUT
#define SPI4_FIRSTBIT   SPI_FIRSTBIT_MSB      // SPI_FIRSTBIT_MSB-SPI_FIRSTBIT_LSB
#define SPI4_DMA_MODE   DMA_NORMAL          // DMA_CIRCULAR-DMA_NORMAL

/**
 * @brief 
 * 
 */
#define SPI4_BAUD                   SPI_BAUDRATEPRESCALER_128 //2-4-8-15-32-64-128
#define SPI4_INTER_DATA_IDLE_CYCLE  SPI_MASTER_INTERDATA_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE
#define SPI4_SS_IDLE_CYCLE          SPI_MASTER_SS_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE

/**
 * @brief 
 * 
 */
//#define SPI4_TX_DMA_CFG   DMA1_STREAM2
//#define SPI4_RX_DMA_CFG   DMA1_STREAM2

/**
 * @brief 
 * 
 */
#define SPI4_TX_DMA_IRQ_PreemptPriority  2
#define SPI4_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define SPI4_RX_DMA_IRQ_PreemptPriority  2
#define SPI4_RX_DMA_IRQ_SubPriority      2
  
/**
 * @brief 
 * 
 */
#define SPI5_NSS_PORT_PIN   AUX_PF6   //PF6-PH5
#define SPI5_SCK_PORT_PIN   AUX_PF7   //PF7-PH6
#define SPI5_MISO_PORT_PIN  AUX_PF8   //PF8-PH7
#define SPI5_MOSI_PORT_PIN  AUX_PF9   //PF9-PF11

#define SPI5_NSS_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI5_NSS_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI5_SCK_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI5_SCK_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI5_MISO_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI5_MISO_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI5_MOSI_PIN_MODE  GPIO_MODE_AF_PP //OD-PP
#define SPI5_MOSI_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

/**
 * @brief 
 * 
 */
#define SPI5_DIRECTION  SPI_DIRECTION_2LINES  // SPI_DIRECTION_2LINES-SPI_DIRECTION_2LINES_RXONLY-SPI_DIRECTION_1LINE
#define SPI5_NSS        SPI_NSS_SOFT          // SPI_NSS_SOFT-SPI_NSS_HARD_INPUT-SPI_NSS_HARD_OUTPUT
#define SPI5_FIRSTBIT   SPI_FIRSTBIT_MSB      // SPI_FIRSTBIT_MSB-SPI_FIRSTBIT_LSB
#define SPI5_DMA_MODE   DMA_NORMAL          // DMA_CIRCULAR-DMA_NORMAL

/**
 * @brief 
 * 
 */
#define SPI5_BAUD                   SPI_BAUDRATEPRESCALER_128 //2-4-8-15-32-64-128
#define SPI5_INTER_DATA_IDLE_CYCLE  SPI_MASTER_INTERDATA_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE
#define SPI5_SS_IDLE_CYCLE          SPI_MASTER_SS_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE

/**
 * @brief 
 * 
 */
//#define SPI5_TX_DMA_CFG   DMA1_STREAM2
//#define SPI5_RX_DMA_CFG   DMA1_STREAM2

/**
 * @brief 
 * 
 */
#define SPI5_TX_DMA_IRQ_PreemptPriority  2
#define SPI5_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define SPI5_RX_DMA_IRQ_PreemptPriority  2
#define SPI5_RX_DMA_IRQ_SubPriority      2
  
/**
 * @brief 
 * 
 */
#define SPI6_NSS_PORT_PIN  AUX_PG8    //PG8
#define SPI6_SCK_PORT_PIN  AUX_PG13   //PG13
#define SPI6_MISO_PORT_PIN  AUX_PG12   //PG12
#define SPI6_MOSI_PORT_PIN  AUX_PG14   //PG14

#define SPI6_NSS_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define SPI6_NSS_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI6_SCK_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define SPI6_SCK_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI6_MISO_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define SPI6_MISO_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define SPI6_MOSI_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define SPI6_MOSI_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

/**
 * @brief 
 * 
 */
#define SPI6_DIRECTION  SPI_DIRECTION_2LINES  // SPI_DIRECTION_2LINES-SPI_DIRECTION_2LINES_RXONLY-SPI_DIRECTION_1LINE
#define SPI6_NSS        SPI_NSS_SOFT          // SPI_NSS_SOFT-SPI_NSS_HARD_INPUT-SPI_NSS_HARD_OUTPUT
#define SPI6_FIRSTBIT   SPI_FIRSTBIT_MSB      // SPI_FIRSTBIT_MSB-SPI_FIRSTBIT_LSB
#define SPI6_DMA_MODE   DMA_CIRCULAR          // DMA_CIRCULAR-DMA_NORMAL

/**
 * @brief 
 * 
 */
#define SPI6_BAUD                   SPI_BAUDRATEPRESCALER_2 //2-4-8-15-32-64-128
#define SPI6_INTER_DATA_IDLE_CYCLE  SPI_MASTER_INTERDATA_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE
#define SPI6_SS_IDLE_CYCLE          SPI_MASTER_SS_IDLENESS_00CYCLE //00CYCLE-01CYCLE ... 15CYCLE

/**
 * @brief 
 * 
 */
//#define SPI6_TX_DMA_CFG   DMA1_STREAM2
//#define SPI6_RX_DMA_CFG   DMA1_STREAM2

/**
 * @brief 
 * 
 */
#define SPI6_TX_DMA_IRQ_PreemptPriority  2
#define SPI6_TX_DMA_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define SPI6_RX_DMA_IRQ_PreemptPriority  2
#define SPI6_RX_DMA_IRQ_SubPriority      2

/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                          ##### Phal I2C Parameter #####                          ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define I2C1_ENABLE
//#define I2C2_ENABLE
//#define I2C3_ENABLE
//#define I2C4_ENABLE

/**
 * @brief 
 * 
 */
#define I2C1_SCL_PORT_PIN  AUX_PB6    //PB6-PB8
#define I2C1_SDA_PORT_PIN  AUX_PB7   //PB7-PB9

#define I2C1_SCL_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define I2C1_SCL_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

#define I2C1_SDA_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define I2C1_SDA_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

/**
 * @brief 
 * 
 */
#define I2C1_TIMING                 0x307075B1
#define I2C1_ADDRESSINGMODE          I2C_ADDRESSINGMODE_7BIT   //I2C_ADDRESSINGMODE_7BIT-I2C_ADDRESSINGMODE_10BIT
#define I2C1_DUALADDRESS             I2C_DUALADDRESS_DISABLED  //I2C_DUALADDRESS_DISABLED-I2C_DUALADDRESS_ENABLED
#define I2C1_GENERALCALL             I2C_GENERALCALL_DISABLED  //I2C_GENERALCALL_DISABLED-I2C_GENERALCALL_ENABLED

/**
 * @brief 
 * 
 */
#define I2C1_ER_IRQ_PreemptPriority  2
#define I2C1_ER_IRQ_SubPriority      2
  
/**
 * @brief 
 * 
 */
#define I2C2_SCL_PORT_PIN  AUX_PF1    //PF1-PH4-PB10
#define I2C2_SDA_PORT_PIN  AUX_PF0   //PF0-PH5-PB11

#define I2C2_SCL_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define I2C2_SCL_PIN_PULL  GPIO_PULLUP //NOPULL-PULLUP-PULLDOWN

#define I2C2_SDA_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define I2C2_SDA_PIN_PULL  GPIO_PULLUP //NOPULL-PULLUP-PULLDOWN

/**
 * @brief 
 * 
 */
#define I2C2_TIMING                 0x307075B1
#define I2C2_ADDRESSINGMODE          I2C_ADDRESSINGMODE_7BIT   //I2C_ADDRESSINGMODE_7BIT-I2C_ADDRESSINGMODE_10BIT
#define I2C2_DUALADDRESS             I2C_DUALADDRESS_DISABLED  //I2C_DUALADDRESS_DISABLED-I2C_DUALADDRESS_ENABLED
#define I2C2_GENERALCALL             I2C_GENERALCALL_DISABLED  //I2C_GENERALCALL_DISABLED-I2C_GENERALCALL_ENABLED

/**
 * @brief 
 * 
 */
#define I2C2_ER_IRQ_PreemptPriority  2
#define I2C2_ER_IRQ_SubPriority      2
  
/**
 * @brief 
 * 
 */
#define I2C3_SCL_PORT_PIN  AUX_PA8    //PA8-PH7
#define I2C3_SDA_PORT_PIN  AUX_PC9   //PC9-PH8

#define I2C3_SCL_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define I2C3_SCL_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

