faraabin/fw_nucleo_h743_faraabin_example/src/app/app_integrator/conf/stm32h7xx_phal_config.h
#define I2C3_SDA_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define I2C3_SDA_PIN_PULL  GPIO_NOPULL //NOPULL-PULLUP-PULLDOWN

/**
 * @brief 
 * 
 */
#define I2C3_TIMING                 0x307075B1
#define I2C3_ADDRESSINGMODE          I2C_ADDRESSINGMODE_7BIT   //I2C_ADDRESSINGMODE_7BIT-I2C_ADDRESSINGMODE_10BIT
#define I2C3_DUALADDRESS             I2C_DUALADDRESS_DISABLED  //I2C_DUALADDRESS_DISABLED-I2C_DUALADDRESS_ENABLED
#define I2C3_GENERALCALL             I2C_GENERALCALL_DISABLED  //I2C_GENERALCALL_DISABLED-I2C_GENERALCALL_ENABLED

/**
 * @brief 
 * 
 */
#define I2C3_ER_IRQ_PreemptPriority  2
#define I2C3_ER_IRQ_SubPriority      2
  
/**
 * @brief 
 * 
 */
#define I2C4_SCL_PORT_PIN  AUX_PF14    //PF14-PH11-PD12-PB6-PB8
#define I2C4_SDA_PORT_PIN  AUX_PF15   //PF15-PH12-PD13-PB7-PB9

#define I2C4_SCL_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define I2C4_SCL_PIN_PULL  GPIO_PULLUP //NOPULL-PULLUP-PULLDOWN

#define I2C4_SDA_PIN_MODE  GPIO_MODE_AF_OD //OD-PP
#define I2C4_SDA_PIN_PULL  GPIO_PULLUP //NOPULL-PULLUP-PULLDOWN

/**
 * @brief 
 * 
 */
#define I2C4_TIMING                 0x307075B1
#define I2C4_ADDRESSINGMODE          I2C_ADDRESSINGMODE_7BIT   //I2C_ADDRESSINGMODE_7BIT-I2C_ADDRESSINGMODE_10BIT
#define I2C4_DUALADDRESS             I2C_DUALADDRESS_DISABLED  //I2C_DUALADDRESS_DISABLED-I2C_DUALADDRESS_ENABLED
#define I2C4_GENERALCALL             I2C_GENERALCALL_DISABLED  //I2C_GENERALCALL_DISABLED-I2C_GENERALCALL_ENABLED

/**
 * @brief 
 * 
 */
#define I2C4_ER_IRQ_PreemptPriority  2
#define I2C4_ER_IRQ_SubPriority      2
  
/**
 * @brief 
 * 
 */
#define I2C_STRETCH_MAX_CLOCK 30

/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                          ##### Phal TICK Parameter #####                         ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
#define PHAL_TICK_ENABLE

/**
 * @brief 
 * 
 */
#define HAL_TICK TICK_TIM2 //TIM2-TIM5

/**
 * @brief 
 * 
 */
#define HAL_TICK_ns  1000

/**
 * @brief 
 * 
 */
#define HAL_TICK_TOP_VALUE  0xFFFFFFFF

/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                         ##### Phal TIMER Parameter #####                         ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define TIMER_CH1_ENABLE                      // This Channel use TIM1 
//#define TIMER_CH2_ENABLE                      // This Channel use TIM2 
//#define TIMER_CH3_ENABLE                      // This Channel use TIM3
//#define TIMER_CH4_ENABLE                      // This Channel use TIM4 
//#define TIMER_CH5_ENABLE                      // This Channel use TIM5 
#define TIMER_CH6_ENABLE                      // This Channel use TIM6 
#define TIMER_CH7_ENABLE                      // This Channel use TIM7 
//#define TIMER_CH8_ENABLE                      // This Channel use TIM8 
  
/**
 * @brief 
 * 
 */
#define TIMER_CH1_IRQ_PreemptPriority  2
#define TIMER_CH1_IRQ_SubPriority      2
  
/**
 * @brief 
 * 
 */
#define TIMER_CH2_IRQ_PreemptPriority  2
#define TIMER_CH2_IRQ_SubPriority      2
 
/**
 * @brief 
 * 
 */
#define TIMER_CH3_IRQ_PreemptPriority  2
#define TIMER_CH3_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define TIMER_CH4_IRQ_PreemptPriority  2
#define TIMER_CH4_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define TIMER_CH5_IRQ_PreemptPriority  2
#define TIMER_CH5_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define TIMER_CH6_IRQ_PreemptPriority  2
#define TIMER_CH6_IRQ_SubPriority      2

/** 
  * @brief
  */
#define TIMER_CH7_IRQ_PreemptPriority  2
#define TIMER_CH7_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define TIMER_CH8_IRQ_PreemptPriority  2
#define TIMER_CH8_IRQ_SubPriority      2

/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                          ##### Phal PWM Parameter #####                          ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
//Help :  CENTERALIGNED3 : Event on both top & zero counter value.
//        CENTERALIGNED2 : Event on top  counter value.
//        CENTERALIGNED1 : Event on zero counter value.

/**
 * @brief 
 * 
 */
//#define TIM1_PWM_CH1_ENABLE
//#define TIM1_PWM_CH2_ENABLE
//#define TIM1_PWM_CH3_ENABLE
//#define TIM1_PWM_CH4_ENABLE

/**
 * @brief 
 * 
 */
#define TIM1_PWM_IRQ_PreemptPriority  0
#define TIM1_PWM_IRQ_SubPriority      0

/**
 * @brief 
 * 
 */
#define TIM1_PWM_MODE TIM_COUNTERMODE_CENTERALIGNED3 //UP-DOWN-CENTERALIGNED1-CENTERALIGNED2-CENTERALIGNED3
#define TIM1_PWM_CLOCK_DIVISION 0
#define TIM1_PWM_PRESCALER 0
#define TIM1_REPETITION_COUNTER 1
#define TIM1_UPDATE_OVF true

/**
 * @brief 
 * 
 */
#define TIM1_SYNC_MASTER_ENABLE
#define TIM1_SYNC_MASTER_MODE TIM_TRGO_UPDATE

//#define TIM1_SYNC_SLAVE_ENABLE
#define TIM1_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM1_SYNC_SLAVE_TRIGGER   TIM_TS_ITR3

/**
 * @brief 
 * 
 */
#define TIM1_PWM_CH1_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define TIM1_PWM_CH1_PORT_PIN  AUX_PE9 //PE9-PA8

#define TIM1_PWM_CH2_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define TIM1_PWM_CH2_PORT_PIN  AUX_PE11 //PE11-PA9

#define TIM1_PWM_CH3_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define TIM1_PWM_CH3_PORT_PIN  AUX_PE13 //PE13-PA10

#define TIM1_PWM_CH4_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define TIM1_PWM_CH4_PORT_PIN  AUX_PE14 //PE14-PA11

/**
 * @brief 
 * 
 */
//#define TIM2_PWM_CH1_ENABLE
//#define TIM2_PWM_CH2_ENABLE
//#define TIM2_PWM_CH3_ENABLE
//#define TIM2_PWM_CH4_ENABLE

/**
 * @brief 
 * 
 */
#define TIM2_PWM_IRQ_PreemptPriority  2
#define TIM2_PWM_IRQ_SubPriority      2
 
/**
 * @brief 
 * 
 */
#define TIM2_PWM_MODE TIM_COUNTERMODE_CENTERALIGNED3 //UP-DOWN-CENTERALIGNED1-CENTERALIGNED2-CENTERALIGNED3
#define TIM2_PWM_CLOCK_DIVISION 0
#define TIM2_PWM_PRESCALER 0
#define TIM2_REPETITION_COUNTER 0

/**
 * @brief 
 * 
 */
//#define TIM2_SYNC_MASTER_ENABLE
#define TIM2_SYNC_MASTER_MODE TIM_TRGO_UPDATE

//#define TIM2_SYNC_SLAVE_ENABLE
#define TIM2_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM2_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0

/**
 * @brief 
 * 
 */
#define TIM2_PWM_CH1_PORT_PIN  AUX_PA0 //PA0-PA5-PA15
#define TIM2_PWM_CH2_PORT_PIN  AUX_PA1 //PA1-PB3
#define TIM2_PWM_CH3_PORT_PIN  AUX_PB10 //PA2-PB10
#define TIM2_PWM_CH4_PORT_PIN  AUX_PB11 //PA3-PB11

/**
 * @brief 
 * 
 */
//#define TIM3_PWM_CH1_ENABLE
//#define TIM3_PWM_CH2_ENABLE
//#define TIM3_PWM_CH3_ENABLE
//#define TIM3_PWM_CH4_ENABLE

/**
 * @brief 
 * 
 */
#define TIM3_PWM_IRQ_PreemptPriority  2
#define TIM3_PWM_IRQ_SubPriority      2
 
/**
 * @brief 
 * 
 */
#define TIM3_PWM_MODE TIM_COUNTERMODE_CENTERALIGNED3 //UP-DOWN-CENTERALIGNED1-CENTERALIGNED2-CENTERALIGNED3
#define TIM3_PWM_CLOCK_DIVISION 0
#define TIM3_PWM_PRESCALER 0
#define TIM3_REPETITION_COUNTER 0

/**
 * @brief 
 * 
 */
//#define TIM3_SYNC_MASTER_ENABLE
#define TIM3_SYNC_MASTER_MODE TIM_TRGO_UPDATE

//#define TIM3_SYNC_SLAVE_ENABLE
#define TIM3_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM3_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0

/**
 * @brief 
 * 
 */
#define TIM3_PWM_CH1_PORT_PIN  AUX_PC6 //PA6-PC6-PB4
#define TIM3_PWM_CH2_PORT_PIN  AUX_PC7 //PA7-PC7-PB5
#define TIM3_PWM_CH3_PORT_PIN  AUX_PC8 //PB0-PC8
#define TIM3_PWM_CH4_PORT_PIN  AUX_PC9 //PB1-PC9

/**
 * @brief 
 * 
 */
//#define TIM4_PWM_CH1_ENABLE
//#define TIM4_PWM_CH2_ENABLE
//#define TIM4_PWM_CH3_ENABLE
//#define TIM4_PWM_CH4_ENABLE

/**
 * @brief 
 * 
 */
#define TIM4_PWM_IRQ_PreemptPriority  2
#define TIM4_PWM_IRQ_SubPriority      2
 
/**
 * @brief 
 * 
 */
#define TIM4_PWM_MODE TIM_COUNTERMODE_CENTERALIGNED3 //UP-DOWN-CENTERALIGNED1-CENTERALIGNED2-CENTERALIGNED3
#define TIM4_PWM_CLOCK_DIVISION 0
#define TIM4_PWM_PRESCALER 0
#define TIM4_REPETITION_COUNTER 0

/**
 * @brief 
 * 
 */
//#define TIM4_SYNC_MASTER_ENABLE
#define TIM4_SYNC_MASTER_MODE TIM_TRGO_UPDATE

//#define TIM4_SYNC_SLAVE_ENABLE
#define TIM4_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM4_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0

/**
 * @brief 
 * 
 */
#define TIM4_PWM_CH1_PORT_PIN  AUX_PD12 //PD12-PB6
#define TIM4_PWM_CH2_PORT_PIN  AUX_PD13 //PD13-PB7
#define TIM4_PWM_CH3_PORT_PIN  AUX_PD14 //PD14-PB8
#define TIM4_PWM_CH4_PORT_PIN  AUX_PB9 //PD15-PB9

/**
 * @brief 
 * 
 */
//#define TIM5_PWM_CH1_ENABLE
//#define TIM5_PWM_CH2_ENABLE
//#define TIM5_PWM_CH3_ENABLE
//#define TIM5_PWM_CH4_ENABLE

/**
 * @brief 
 * 
 */
#define TIM5_PWM_IRQ_PreemptPriority  2
#define TIM5_PWM_IRQ_SubPriority      2
 
/**
 * @brief 
 * 
 */
#define TIM5_PWM_MODE TIM_COUNTERMODE_CENTERALIGNED3 //UP-DOWN-CENTERALIGNED1-CENTERALIGNED2-CENTERALIGNED3
#define TIM5_PWM_CLOCK_DIVISION 0
#define TIM5_PWM_PRESCALER 0
#define TIM5_REPETITION_COUNTER 0

/**
 * @brief 
 * 
 */
//#define TIM5_SYNC_MASTER_ENABLE
#define TIM5_SYNC_MASTER_MODE TIM_TRGO_UPDATE

//#define TIM5_SYNC_SLAVE_ENABLE
#define TIM5_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM5_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0

/**
 * @brief 
 * 
 */
#define TIM5_PWM_CH1_PORT_PIN  AUX_PA0 //PH10-PA0
#define TIM5_PWM_CH2_PORT_PIN  AUX_PA1 //PH11-PA1
#define TIM5_PWM_CH3_PORT_PIN  AUX_PA2 //PH12-PA2
#define TIM5_PWM_CH4_PORT_PIN  AUX_PA3 //PI0-PA3

/**
 * @brief 
 * 
 */
//#define TIM8_PWM_CH1_ENABLE
//#define TIM8_PWM_CH2_ENABLE
//#define TIM8_PWM_CH3_ENABLE
//#define TIM8_PWM_CH4_ENABLE

/**
 * @brief 
 * 
 */
#define TIM8_PWM_IRQ_PreemptPriority  2
#define TIM8_PWM_IRQ_SubPriority      2
 
/**
 * @brief 
 * 
 */
#define TIM8_PWM_MODE TIM_COUNTERMODE_CENTERALIGNED3 //UP-DOWN-CENTERALIGNED1-CENTERALIGNED2-CENTERALIGNED3
#define TIM8_PWM_CLOCK_DIVISION 0
#define TIM8_PWM_PRESCALER 0
#define TIM8_REPETITION_COUNTER 1
#define TIM8_UPDATE_OVF true

/**
 * @brief 
 * 
 */
//#define TIM8_SYNC_MASTER_ENABLE
#define TIM8_SYNC_MASTER_MODE TIM_TRGO_UPDATE

#define TIM8_SYNC_SLAVE_ENABLE
#define TIM8_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM8_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0 //TIM_TS_ITR2

/**
 * @brief 
 * 
 */
#define TIM8_PWM_CH1_POLARITY  TIM_OCPOLARITY_LOW //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define TIM8_PWM_CH1_PORT_PIN  AUX_PC6 //PC6-PI5

