faraabin/fw_nucleo_h743_faraabin_example/src/app/app_integrator/conf/stm32h7xx_phal_config.h
#define TIM8_PWM_CH2_POLARITY  TIM_OCPOLARITY_LOW //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define TIM8_PWM_CH2_PORT_PIN  AUX_PC7 //PC7-PI6

#define TIM8_PWM_CH3_POLARITY  TIM_OCPOLARITY_LOW //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define TIM8_PWM_CH3_PORT_PIN  AUX_PC8 //PC8-PI7

#define TIM8_PWM_CH4_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define TIM8_PWM_CH4_PORT_PIN  AUX_PC9 //PC9-PI2

/**
 * @brief 
 * 
 */
//#define TIM9_PWM_CH1_ENABLE
//#define TIM9_PWM_CH2_ENABLE

/**
 * @brief 
 * 
 */
#define TIM9_PWM_IRQ_PreemptPriority  2
#define TIM9_PWM_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define TIM9_PWM_CLOCK_DIVISION 0
#define TIM9_PWM_PRESCALER 0
#define TIM9_REPETITION_COUNTER 0

/**
 * @brief 
 * 
 */
//#define TIM9_SYNC_MASTER_ENABLE
#define TIM9_SYNC_MASTER_MODE TIM_TRGO_UPDATE

//#define TIM9_SYNC_SLAVE_ENABLE
#define TIM9_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM9_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0
 
/**
 * @brief 
 * 
 */
#define TIM9_PWM_CH1_PORT_PIN  AUX_PA2 //PE5-PA2
#define TIM9_PWM_CH2_PORT_PIN  AUX_PA3 //PA3

/**
 * @brief 
 * 
 */
//#define TIM10_PWM_CH1_ENABLE

/**
 * @brief 
 * 
 */
#define TIM10_PWM_CLOCK_DIVISION 0
#define TIM10_PWM_PRESCALER 0
#define TIM10_REPETITION_COUNTER 0

/**
 * @brief 
 * 
 */
//#define TIM10_SYNC_MASTER_ENABLE
#define TIM10_SYNC_MASTER_MODE TIM_TRGO_UPDATE

//#define TIM10_SYNC_SLAVE_ENABLE
#define TIM10_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM10_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0

/**
 * @brief 
 * 
 */
#define TIM10_PWM_CH1_PORT_PIN  AUX_PB8 //PF6-PB8

/**
 * @brief 
 * 
 */
//#define TIM11_PWM_CH1_ENABLE

/**
 * @brief 
 * 
 */
#define TIM11_PWM_CLOCK_DIVISION 0
#define TIM11_PWM_PRESCALER 0
#define TIM11_REPETITION_COUNTER 0

/**
 * @brief 
 * 
 */
//#define TIM11_SYNC_MASTER_ENABLE
#define TIM11_SYNC_MASTER_MODE TIM_TRGO_UPDATE

//#define TIM11_SYNC_SLAVE_ENABLE
#define TIM11_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM11_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0

/**
 * @brief 
 * 
 */
#define TIM11_PWM_CH1_PORT_PIN  AUX_PB9 //PF7-PB9

/**
 * @brief 
 * 
 */
//#define TIM12_PWM_CH1_ENABLE
//#define TIM12_PWM_CH2_ENABLE

/**
 * @brief 
 * 
 */
#define TIM12_PWM_CLOCK_DIVISION 0
#define TIM12_PWM_PRESCALER 0
#define TIM12_REPETITION_COUNTER 0

/**
 * @brief 
 * 
 */
//#define TIM12_SYNC_MASTER_ENABLE
#define TIM12_SYNC_MASTER_MODE TIM_TRGO_UPDATE

//#define TIM12_SYNC_SLAVE_ENABLE
#define TIM12_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM12_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0

/**
 * @brief 
 * 
 */
#define TIM12_PWM_CH1_PORT_PIN  AUX_PB14 //PH6-PB14
#define TIM12_PWM_CH2_PORT_PIN  AUX_PB15 //PH9-PB15

/**
 * @brief 
 * 
 */
//#define TIM13_PWM_CH1_ENABLE

/**
 * @brief 
 * 
 */
#define TIM13_PWM_CLOCK_DIVISION 0
#define TIM13_PWM_PRESCALER 0
#define TIM13_REPETITION_COUNTER 0

/**
 * @brief 
 * 
 */
//#define TIM13_SYNC_MASTER_ENABLE
#define TIM13_SYNC_MASTER_MODE TIM_TRGO_UPDATE

//#define TIM13_SYNC_SLAVE_ENABLE
#define TIM13_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM13_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0

/**
 * @brief 
 * 
 */
#define TIM13_PWM_CH1_PORT_PIN  AUX_PF8 //PF8-PA6

/**
 * @brief 
 * 
 */
//#define TIM14_PWM_CH1_ENABLE

/**
 * @brief 
 * 
 */
#define TIM14_PWM_CLOCK_DIVISION 0
#define TIM14_PWM_PRESCALER 0
#define TIM14_REPETITION_COUNTER 0

/**
 * @brief 
 * 
 */
//#define TIM14_SYNC_MASTER_ENABLE
#define TIM14_SYNC_MASTER_MODE TIM_TRGO_UPDATE

//#define TIM14_SYNC_SLAVE_ENABLE
#define TIM14_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
#define TIM14_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0

/**
 * @brief 
 * 
 */
#define TIM14_PWM_CH1_PORT_PIN  AUX_PF9 //PF9-PA7

/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                       ##### Phal HRTIM PWM Parameter #####                       ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define HRTIM1_PWM_CHA1_ENABLE
//#define HRTIM1_PWM_CHA2_ENABLE
//#define HRTIM1_PWM_CHB1_ENABLE
//#define HRTIM1_PWM_CHB2_ENABLE
//#define HRTIM1_PWM_CHC1_ENABLE
//#define HRTIM1_PWM_CHC2_ENABLE
//#define HRTIM1_PWM_CHD1_ENABLE
//#define HRTIM1_PWM_CHD2_ENABLE
//#define HRTIM1_PWM_CHE1_ENABLE
//#define HRTIM1_PWM_CHE2_ENABLE

/**
 * @brief 
 * 
 */
//#define TIM1_PWM_IRQ_PreemptPriority  2
//#define TIM1_PWM_IRQ_SubPriority      2
 
/**
 * @brief 
 * 
 */
//#define TIM1_PWM_MODE TIM_COUNTERMODE_UP //UP-DOWN-CENTERALIGNED1-CENTERALIGNED2-CENTERALIGNED3
#define HRTIM1_PWM_CLOCK_DIVISION 0
#define HRTIM1_PWM_PRESCALER HRTIM_PRESCALERRATIO_DIV1 //HRTIM_PRESCALERRATIO_DIV1,2,4

/**
 * @brief 
 * 
 */
//#define TIM1_SYNC_MASTER_ENABLE
//#define TIM1_SYNC_SLAVE_ENABLE
//#define TIM1_SYNC_SLAVE_MODE      TIM_SLAVEMODE_RESET
//#define TIM1_SYNC_SLAVE_TRIGGER   TIM_TS_ITR0

/**
 * @brief 
 * 
 */
//#define HRTIM1_PWM_CHA1_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define HRTIM1_PWM_CHA1_PORT_PIN  AUX_PC6 //PC6

//#define HRTIM1_PWM_CHA2_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define HRTIM1_PWM_CHA2_PORT_PIN  AUX_PC7 //PC7

//#define HRTIM1_PWM_CHB1_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define HRTIM1_PWM_CHB1_PORT_PIN  AUX_PC8 //PC8

//#define HRTIM1_PWM_CHB2_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define HRTIM1_PWM_CHB2_PORT_PIN  AUX_PA8 //PA8

//#define HRTIM1_PWM_CHC1_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define HRTIM1_PWM_CHC1_PORT_PIN  AUX_PA9 //PA9

//#define HRTIM1_PWM_CHC2_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define HRTIM1_PWM_CHC2_PORT_PIN  AUX_PA10 //PA10

//#define HRTIM1_PWM_CHD1_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define HRTIM1_PWM_CHD1_PORT_PIN  AUX_PA11 //PA11

//#define HRTIM1_PWM_CHD2_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define HRTIM1_PWM_CHD2_PORT_PIN  AUX_PA12 //PA12

//#define HRTIM1_PWM_CHE1_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define HRTIM1_PWM_CHE1_PORT_PIN  AUX_PG6 //PG6

//#define HRTIM1_PWM_CHE2_POLARITY  TIM_OCPOLARITY_HIGH //TIM_OCPOLARITY_HIGH-TIM_OCPOLARITY_LOW
#define HRTIM1_PWM_CHE2_PORT_PIN  AUX_PG7 //PG7

