faraabin/fw_nucleo_h743_faraabin_example/src/app/app_integrator/conf/stm32h7xx_phal_config.h
/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                 ##### Phal Incremental Encoder Parameter #####                   ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define TIM1_INC_ENCODER_ENABLE
//#define TIM2_INC_ENCODER_ENABLE
//#define TIM3_INC_ENCODER_ENABLE
//#define TIM4_INC_ENCODER_ENABLE
//#define TIM5_INC_ENCODER_ENABLE
//#define TIM8_INC_ENCODER_ENABLE

/**
 * @brief 
 * 
 */
#define TIM1_TI1_PORT_PIN  AUX_PA8 //PE9-PA8
#define TIM1_TI2_PORT_PIN  AUX_PA9 //PE11-PA9

/**
 * @brief 
 * 
 */
#define TIM2_TI1_PORT_PIN  AUX_PA0 //PA0-PA5-PA15
#define TIM2_TI2_PORT_PIN  AUX_PA1 //PA1-PB3

/**
 * @brief 
 * 
 */
#define TIM3_TI1_PORT_PIN  AUX_PA6 //PA6-PC6-PB4
#define TIM3_TI2_PORT_PIN  AUX_PA7 //PA7-PC7-PB5

/**
 * @brief 
 * 
 */
#define TIM4_TI1_PORT_PIN  AUX_PB6 //PD12-PB6
#define TIM4_TI2_PORT_PIN  AUX_PB7 //PD13-PB7

/**
 * @brief 
 * 
 */
#define TIM5_TI1_PORT_PIN  AUX_PA0 //PH10-PA0
#define TIM5_TI2_PORT_PIN  AUX_PA1 //PH11-PA1

/**
 * @brief 
 * 
 */
#define TIM8_TI1_PORT_PIN  AUX_PC6 //PC6-PI5
#define TIM8_TI2_PORT_PIN  AUX_PC7 //PC7-PI6

/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                          ##### Phal GPIO Parameter #####                         ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define GPIO_PA0
//#define GPIO_PA1
//#define GPIO_PA2
//#define GPIO_PA3
//#define GPIO_PA4
//#define GPIO_PA5
//#define GPIO_PA6
//#define GPIO_PA7
//#define GPIO_PA8
//#define GPIO_PA9
//#define GPIO_PA10
#define GPIO_PA11
//#define GPIO_PA12
//#define GPIO_PA13
//#define GPIO_PA14
//#define GPIO_PA15

/**
 * @brief 
 * 
 */
#define GPIO_PB0
//#define GPIO_PB1
//#define GPIO_PB2
//#define GPIO_PB3
//#define GPIO_PB4
//#define GPIO_PB5
//#define GPIO_PB6
#define GPIO_PB7
//#define GPIO_PB8
//#define GPIO_PB9
//#define GPIO_PB10
//#define GPIO_PB11
//#define GPIO_PB12
//#define GPIO_PB13
#define GPIO_PB14
//#define GPIO_PB15

/**
 * @brief 
 * 
 */
//#define GPIO_PC0
//#define GPIO_PC1
//#define GPIO_PC2
//#define GPIO_PC3
//#define GPIO_PC4
//#define GPIO_PC5
//#define GPIO_PC6
//#define GPIO_PC7
//#define GPIO_PC8
//#define GPIO_PC9
//#define GPIO_PC10
//#define GPIO_PC11
//#define GPIO_PC12
#define GPIO_PC13
//#define GPIO_PC14
//#define GPIO_PC15

/**
 * @brief 
 * 
 */
//#define GPIO_PD0
//#define GPIO_PD1
//#define GPIO_PD2
//#define GPIO_PD3
//#define GPIO_PD4
//#define GPIO_PD5
//#define GPIO_PD6
//#define GPIO_PD7
//#define GPIO_PD8
//#define GPIO_PD9
//#define GPIO_PD10
//#define GPIO_PD11
//#define GPIO_PD12
//#define GPIO_PD13
//#define GPIO_PD14
//#define GPIO_PD15

/**
 * @brief 
 * 
 */
//#define GPIO_PE0
//#define GPIO_PE1
//#define GPIO_PE2
//#define GPIO_PE3
//#define GPIO_PE4
//#define GPIO_PE5
//#define GPIO_PE6
//#define GPIO_PE7
//#define GPIO_PE8
//#define GPIO_PE9
//#define GPIO_PE10
//#define GPIO_PE11
//#define GPIO_PE12
//#define GPIO_PE13
//#define GPIO_PE14
//#define GPIO_PE15

/**
 * @brief 
 * 
 */
//#define GPIO_PF0
//#define GPIO_PF1
//#define GPIO_PF2
//#define GPIO_PF3
//#define GPIO_PF4
//#define GPIO_PF5
//#define GPIO_PF6
//#define GPIO_PF7
//#define GPIO_PF8
//#define GPIO_PF9
//#define GPIO_PF10
//#define GPIO_PF11
//#define GPIO_PF12
//#define GPIO_PF13
//#define GPIO_PF14
//#define GPIO_PF15

/**
 * @brief 
 * 
 */
//#define GPIO_PG0
//#define GPIO_PG1
//#define GPIO_PG2
//#define GPIO_PG3
//#define GPIO_PG4
//#define GPIO_PG5
//#define GPIO_PG6
//#define GPIO_PG7
//#define GPIO_PG8
//#define GPIO_PG9
//#define GPIO_PG10
//#define GPIO_PG11
//#define GPIO_PG12
//#define GPIO_PG13
//#define GPIO_PG14
//#define GPIO_PG15

/**
 * @brief 
 * 
 */
//#define GPIO_PH0
//#define GPIO_PH1
//#define GPIO_PH2
//#define GPIO_PH3
//#define GPIO_PH4
//#define GPIO_PH5
//#define GPIO_PH6
//#define GPIO_PH7
//#define GPIO_PH8
//#define GPIO_PH9
//#define GPIO_PH10
//#define GPIO_PH11
//#define GPIO_PH12
//#define GPIO_PH13
//#define GPIO_PH14
//#define GPIO_PH15

/**
 * @brief 
 * 
 */
//#define GPIO_PI0
//#define GPIO_PI1
//#define GPIO_PI2
//#define GPIO_PI3
//#define GPIO_PI4
//#define GPIO_PI5
//#define GPIO_PI6
//#define GPIO_PI7
//#define GPIO_PI8
//#define GPIO_PI9
//#define GPIO_PI10
//#define GPIO_PI11
//#define GPIO_PI12
//#define GPIO_PI13
//#define GPIO_PI14
//#define GPIO_PI15

/**
 * @brief 
 * 
 */
//#define GPIO_PJ0
//#define GPIO_PJ1
//#define GPIO_PJ2
//#define GPIO_PJ3
//#define GPIO_PJ4
//#define GPIO_PJ5
//#define GPIO_PJ6
//#define GPIO_PJ7
//#define GPIO_PJ8
//#define GPIO_PJ9
//#define GPIO_PJ10
//#define GPIO_PJ11
//#define GPIO_PJ12
//#define GPIO_PJ13
//#define GPIO_PJ14
//#define GPIO_PJ15

/**
 * @brief 
 * 
 */
//#define GPIO_PK0
//#define GPIO_PK1
//#define GPIO_PK2
//#define GPIO_PK3
//#define GPIO_PK4
//#define GPIO_PK5
//#define GPIO_PK6
//#define GPIO_PK7
//#define GPIO_PK8
//#define GPIO_PK9
//#define GPIO_PK10
//#define GPIO_PK11
//#define GPIO_PK12
//#define GPIO_PK13
//#define GPIO_PK14
//#define GPIO_PK15

/**
 * @brief 
 * 
 */
//#define EXTI0_PORT  GPIOA
//#define EXTI1_PORT  GPIOA
//#define EXTI2_PORT  GPIOA
//#define EXTI3_PORT  GPIOA
//#define EXTI4_PORT  GPIOA
//#define EXTI5_PORT  GPIOA
//#define EXTI6_PORT  GPIOA
//#define EXTI7_PORT  GPIOA
//#define EXTI8_PORT  GPIOB
//#define EXTI9_PORT  GPIOA
//#define EXTI10_PORT GPIOA
//#define EXTI11_PORT GPIOA
//#define EXTI12_PORT GPIOA
//#define EXTI13_PORT GPIOA
//#define EXTI14_PORT GPIOA
//#define EXTI15_PORT GPIOA

/**
 * @brief 
 * 
 */
#define EXTI_CH0_IRQ_PreemptPriority  2
#define EXTI_CH0_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define EXTI_CH1_IRQ_PreemptPriority  2
#define EXTI_CH1_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define EXTI_CH2_IRQ_PreemptPriority  2
#define EXTI_CH2_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define EXTI_CH3_IRQ_PreemptPriority  2
#define EXTI_CH3_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define EXTI_CH4_IRQ_PreemptPriority  2
#define EXTI_CH4_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define EXTI_CH9_5_IRQ_PreemptPriority  2
#define EXTI_CH9_5_IRQ_SubPriority      2

/**
 * @brief 
 * 
 */
#define EXTI_CH15_10_IRQ_PreemptPriority  2
#define EXTI_CH15_10_IRQ_SubPriority      2

