faraabin/fw_nucleo_h743_faraabin_example/src/app/app_integrator/conf/stm32h7xx_phal_config.h
/*
╔══════════════════════════════════════════════════════════════════════════════════╗
║                          ##### Phal ADC Parameter #####                          ║
╚══════════════════════════════════════════════════════════════════════════════════╝
*/
/**
 * @brief 
 * 
 */
//#define ADC1_CH0_ENABLE
//#define ADC1_CH1_ENABLE
//#define ADC1_CH2_ENABLE
//#define ADC1_CH3_ENABLE
//#define ADC1_CH4_ENABLE
//#define ADC1_CH5_ENABLE
//#define ADC1_CH6_ENABLE
//#define ADC1_CH7_ENABLE
//#define ADC1_CH8_ENABLE
//#define ADC1_CH9_ENABLE
//#define ADC1_CH10_ENABLE
//#define ADC1_CH11_ENABLE
//#define ADC1_CH12_ENABLE
//#define ADC1_CH13_ENABLE
//#define ADC1_CH14_ENABLE
//#define ADC1_CH15_ENABLE
//#define ADC1_CH16_ENABLE
//#define ADC1_CH17_ENABLE
//#define ADC1_CH18_ENABLE
//#define ADC1_CH19_ENABLE

/**
 * @brief 
 * 
 */
#define ADC1_SAMPLETIME       ADC_SAMPLETIME_32CYCLES_5
#define ADC1_FREE_RUN_ENABLE  false
#define ADC1_EXT_TRIG         ADC_EXTERNALTRIG_T1_TRGO

/**
 * @brief 
 * 
 */
#define ADC1_DMA_CFG   DMA2_STREAM0

/**
 * @brief 
 * 
 */
//#define ADC2_CH0_ENABLE
//#define ADC2_CH1_ENABLE
//#define ADC2_CH2_ENABLE
//#define ADC2_CH3_ENABLE
//#define ADC2_CH4_ENABLE
//#define ADC2_CH5_ENABLE
//#define ADC2_CH6_ENABLE
//#define ADC2_CH7_ENABLE
//#define ADC2_CH8_ENABLE
//#define ADC2_CH9_ENABLE
//#define ADC2_CH10_ENABLE
//#define ADC2_CH11_ENABLE
//#define ADC2_CH12_ENABLE
//#define ADC2_CH13_ENABLE
//#define ADC2_CH14_ENABLE
//#define ADC2_CH15_ENABLE
//#define ADC2_CH18_ENABLE
//#define ADC2_CH19_ENABLE

/**
 * @brief 
 * 
 */
#define ADC2_SAMPLETIME       ADC_SAMPLETIME_8CYCLES_5
#define ADC2_FREE_RUN_ENABLE  false
#define ADC2_EXT_TRIG         ADC_EXTERNALTRIG_T8_TRGO

/**
 * @brief 
 * 
 */
#define ADC2_DMA_CFG   DMA2_STREAM4

/**
 * @brief 
 * 
 */
//#define ADC3_CH0_ENABLE
//#define ADC3_CH1_ENABLE
//#define ADC3_CH2_ENABLE
//#define ADC3_CH3_ENABLE
//#define ADC3_CH4_ENABLE
//#define ADC3_CH5_ENABLE
//#define ADC3_CH6_ENABLE
//#define ADC3_CH7_ENABLE
//#define ADC3_CH8_ENABLE
//#define ADC3_CH9_ENABLE
//#define ADC3_CH10_ENABLE
//#define ADC3_CH11_ENABLE
//#define ADC3_CH12_ENABLE
//#define ADC3_CH13_ENABLE
//#define ADC3_CH14_ENABLE
//#define ADC3_CH15_ENABLE
//#define ADC3_TEMPERATURE_ENABLE

/**
 * @brief 
 * 
 */
#define ADC3_SAMPLETIME       ADC_SAMPLETIME_32CYCLES_5
#define ADC3_FREE_RUN_ENABLE  false
#define ADC3_EXT_TRIG         ADC_EXTERNALTRIG_T1_TRGO

/**
 * @brief 
 * 
 */
#define ADC3_DMA_CFG DMA2_STREAM1

/* Exported macro ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported functions prototypes ---------------------------------------------*/
/* Exported variables --------------------------------------------------------*/

#include "stm32h7xx_phal_internal.h"

#ifdef __cplusplus
}
#endif

#endif /* STM32H7XX_PHAL_CONFIG_H */

/************************ © COPYRIGHT FaraabinCo *****END OF FILE****/
